{"head":{"title":"My Internship at 99x Technology","date":"2012-11-02T00:00:00.000Z","layout":"Post","link":"http://asankan.info/2012/11/02/my-internship-at-99x-technology/","author":"asankanissanka","description":"My Internship at 99x Technology I was a Java and open-source enthusiast and a geek when I was starting my internship. I never thought out…","post_id":10,"created":"2012/11/02 05:40:00","created_gmt":"2012/11/02 05:40:00","comment_status":"open","post_name":"my-internship-at-99x-technology","status":"publish","post_type":"post"},"body":"<h1 id=\"my-internship-at-99x-technology\"><a href=\"#my-internship-at-99x-technology\" class=\"phenomic-HeadingAnchor\">#</a>My Internship at 99x Technology</h1>\n<p>I was a Java and open-source enthusiast and a geek when I was starting my internship. I never thought out of that scope. What I looked for was mostly to implement,code using the features provided by the frameworks and libraries, there the intention was to how ever deliver each and every features of the so called frameworks and libraries. So I was failing at delivering the true value of a solution.  </p>\n<p>Then I was hired by a company called <a href=\"http://www.99xtechnology.com/\">99x Technology</a> which is a product engineering company. They had realized what my passion was and gave me a chance start my work with contributing an open-source framework called <a href=\"http://boilerplatejs.org/\">BoilerplateJS</a>. It is a reference architecture built using JavaScript following the industry best practices. Well that's bit of technical stuff about it... What I wanted to imply here is that when working with this project under the supervision of <a href=\"http://www.hasith.net/\">Hasith</a>,the technology manager of <a href=\"http://www.99xtechnology.com/\">99x Technology</a>, I could learn lots of things. Among those what I cared the most is that when we designing a solution we should not think of it within the scope of a particular technology, framework or a library. When we designing this solution there were some scenarios to which we looked into. There we first decide the optimum solution and then looked for the technology which can cater that requirement, and the selection was not based on the number of features it has (Which is the main criteria of most of the people). So though out this project I could get exposed to some cutting edge technologies like <a href=\"http://addyosmani.com/resources/essentialjsdesignpatterns/book/\">Advanced JavaScript</a>,<a href=\"http://requirejs.org/\"> RequireJS</a>, <a href=\"http://knockoutjs.com/\">KnockoutJS</a>, <a href=\"http://millermedeiros.github.com/crossroads.js/\">Crossroads</a>, <a href=\"http://amplifyjs.com/\">AmplifyJS</a>, <a href=\"http://jquery.com/\">jQuery</a>, <a href=\"http://git-scm.com/\">Git</a>, <a href=\"http://yui.github.com/yuidoc/\">YUI Doc</a> and patterns like MVVM, Modular Pattern and AMD (Asynchronous Module Definition, which is a modern modular JavaScript design pattern).  </p>\n<p>Next I was given a chance to work on a customer project (I won't be sharing more details on this since they are confidential). There I was asked to build a wordpress plugin using PHP, and this was a totally different domain for me though I had worked with PHP. I could get some what of a exposure working with customers and I was guided and supervised throughout the project to achieve my targets by Samudra Kanankearachchi, Software Architect at <a href=\"http://www.99xtechnology.com/\">99x Technology</a>. And I could successfully complete my work in that and deliver a product with value.  </p>\n<p>Then I joined with an internal project which was requested to be delivered within a short time period. With this project I could get the experience of working under a pressure. I think our team could reach the targets on time. And during this I got a chance to work on a separate domain, which is normally carried out by IM (Infrastructure Management) personnel. That is to configure a production web server running linux. I really enjoyed and put a considerable effort on this due to the lot's of configurations there.   </p>\n<p>Finally it's the end of the internship and I thought to write this blog post because I am totally satisfied about it and I can proudly say that I could make lot's of dots in my life during the stay at <a href=\"http://www.99xtechnology.com/\">99x Technology</a>.</p>\n<h2 id=\"comments\"><a href=\"#comments\" class=\"phenomic-HeadingAnchor\">#</a>Comments</h2>\n<p><strong><a href=\"#5\" title=\"2012-11-02 14:16:57\">Chanaka Dharmarathna</a>:</strong> Nice to hear that you have used some cutting edge technologies like KnockoutJS etc. as well as GIT VCS. Use these things again and again without bounding to one thing. Thats how you could add a value to you. All the best!</p>\n","__filename":"posts/20121102-my-internship-at-99x-technology.md","__url":"/posts/20121102-my-internship-at-99x-technology/","__resourceUrl":"/posts/20121102-my-internship-at-99x-technology/index.html","__dataUrl":"/posts/20121102-my-internship-at-99x-technology/index.html.0775d8b9322632435340b4a898bb9a7c.json"}